#include <stdio.h>

//算法总结，n个变量的n-1个关系表达式总能转化为《两个变量的一个表达式》
//---根据变量为整数,可以很快明确各个变量的值
int main1()
{
	//公鸡5元1只，母鸡3元1只，小鸡1元3只，100元买100只鸡有多少方法
	int i, j, k, n;
	//i + j + k = 100
	//i*5 + j*3 + k/3 = 100---------15*i+9*j+k=300-----15*i+9*j+100-i-j=300
	//14*i+8*j=200-----7*i+4*j=100----j= 25 - 7/4*i--整数要求&&j>0-----i = 4*n
	for (n = 0; n < 4; n++)
	{
		i = 4*n;
		j = 25 - 7*n;
		k = 100 - i - j;
		printf("i = %d,j = %d, k = %d", i, j, k);
	}

	return 0;

}

int main()
{
	// 现在有五家共用一口井，
	// 甲、乙、丙、丁、戌五家各有一条绳子汲水
	// （下面用文字表示每一家的绳子）：
	// 甲×2 + 乙 = 井深，
	// 乙×3 + 丙 = 井深，
	// 丙×4 + 丁 = 井深，
	// 丁×5 + 戊 = 井深，
	// 戊×6 + 甲 = 井深，
	// 求甲、乙、丙、丁、戊各家绳子的长度和井深。
	//w*6 + (h - (h - (h - (h - w) / 5) / 4) / 3) / 2 = h
	// 戊×721 = 井深*76，
	// 戊= 井深*76/721; -->井深=721*n;
	int j, y, b, d, w, h;
	int n;
	for (n = 1; n < 3; n++)//n的是可变的最小为1，也就是求得最小绳长和井深
	{
		h = 721 * n;
		w = 76 * n;
		j = h - w * 6;
		y = h - j * 2;
		b = h - y * 3;
		d = h - b * 4;
		printf("j = %d, y = %d, b = %d, d = %d, w = %d, h = %d\n", j, y, b, d, w, h);

	}
	
	return 0;
}